#+PROPERTY: header-args  :session README
**** create folders for new version
#+BEGIN_SRC python :results output drawer pp :file README.py

  import os
  import glob
  import pathlib

  sources = glob.glob('./layouts/qwerty/*/*/unzipped/moonlander_qwerty_source')
  src =  sources[-1]
  version = src.replace('./layouts/qwerty', '').replace('/unzipped/moonlander_qwerty_source', '').lstrip('/')
  current_minor_version = version[-1]
  new_minor_version = str(int(current_minor_version) + 1)
  src_tpl = src.rpartition(current_minor_version)
  dst = ''.join(src_tpl[0] + new_minor_version + '/unzipped')

  print(f'{src=}\n{version=}\n{current_minor_version=}\n{new_minor_version=}\n{dst=}')
  pathlib.Path(dst).mkdir(parents=True, exist_ok=True)

#+END_SRC

#+RESULTS:
: src='./layouts/qwerty/2/1/unzipped/moonlander_qwerty_source'
: version='2/1'
: current_minor_version='1'
: new_minor_version='2'
: dst='./layouts/qwerty/2/2/unzipped'

**** link sources

#+BEGIN_SRC python :results output drawer :file README.py
  import os
  import glob

  sources = glob.glob('./layouts/qwerty/*/*/unzipped/moonlander_qwerty_source')
  # path = glob.glob('./layouts/qwerty/*/*/')
  src =  sources[-1]
  version = src.replace('./layouts/qwerty', '').replace('/unzipped/moonlander_qwerty_source', '').replace('/','.').lstrip('.')
  dst = f'./qmk_firmware/keyboards/moonlander/keymaps/{version}'
  rel_path_src = os.path.relpath(src, os.path.dirname(dst))
  os.symlink(rel_path_src, dst)
  print(src, version, dst, sep='\n')
  # all_folders = os.listdir(path[-1])
  # print(all_folders)
  # all_folders.sort()
  # latest = all_folders[-1].replace('ID', '')
  # new = int(latests) + 1
  # os.makedirs('ID'+str(latest))
  print(f'make moonlander:{version}')
#+END_SRC

#+RESULTS:
:results:
:end:

